# Binaries
# Perhaps most importantly...
brew "zsh"

#  Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

tap "buo/cask-upgrade"
tap "romkatv/powerlevel10k"

# Better bash as a backup
brew "bash"
brew "bash-completion"

# GNU utilities (those that come with macOS are outdated)
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnutls"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-indent"
brew "gnu-which"

# wget with IRI support
brew "wget"  #, args: ["with-iri"]

# GnuPG to enable PGP-signing commits
brew "gnupg"

# More recent versions of some macOS tools
brew "vim"  #, args: ["with-override-system-vi"]
brew "grep"
brew "openssh"
brew "curl", link: true
#brew "gcc"
#brew "make"
#brew "screen"
#brew "gmp"

# Other useful binaries
brew "less"
brew "p7zip"
brew "rename"

# Git
brew "git"
brew "git-lfs"
brew "git-crypt"
brew "gh"

# Mostly ordinary binaries
brew "jq"
brew "mas"
brew "netcat"
brew "python@3.9"
brew "python"
brew "pyenv"
brew "whois", link: true
brew "youtube-dl"

# Pentesting tools

###############################
#  macOS Apps via Cask        #
###############################

cask_args appdir: "/Applications"

# System Utilities
cask "appcleaner"
cask "coconutbattery"
cask "geekbench"
cask "istat-menus"
cask "macupdater"
cask "the-unarchiver"
cask "transmission"
cask "vnc-viewer"

# Passwords, VPNs, other Security
cask "bitwarden"
#cask "1password"
#cask "authy"
#cask "gpg-suite"
#cask "keybase"
#cask "little-snitch"
#cask "tor-browser"
#cask "tunnelblick"

# Development/Work
cask "adoptopenjdk/openjdk/adoptopenjdk"
cask "iterm2"
cask "microsoft-office"
cask "sketch"
cask "tower"
cask "transmit"
cask "visual-studio-code"

# Media
cask "handbrake"

# Others
cask "barrier"
cask "rectangle"
cask "vlc"
cask "clocker"
cask "google-drive"
cask "caffeine"
cask "itsycal"

# Communication/Social
cask "skype"
cask "slack"
cask "whatsapp"
cask "zoomus"

# Browsers (for reference only -- install these via offline DMGs no matter what)
# * Firefox
#    - Stable
#    - Dev: https://www.mozilla.org/en-US/firefox/developer/
#    - Nightly: https://www.mozilla.org/en-US/firefox/channel/desktop/
# * Chrome
#    - Stable
#    - Canary: https://www.google.com/chrome/canary/
# * Safari
#    - Preview: https://developer.apple.com/safari/technology-preview/

###############################
#  Fonts                      #
###############################

# Monospace
cask "homebrew/cask-fonts/font-roboto-mono"
cask "homebrew/cask-fonts/font-sf-mono"  # iTerm/VS Code font, comes in .pkg
cask "homebrew/cask-fonts/font-sf-mono-for-powerline"

# Sans/Serif
cask "homebrew/cask-fonts/font-comic-neue"
cask "homebrew/cask-fonts/font-roboto"
cask "homebrew/cask-fonts/font-open-sans"

###############################
#  macOS Apps via App Store   #
###############################

# Apple
#mas "Apple Configurator 2", id: 1037126344
#mas "Compressor", id: 424390742
#mas "Developer", id: 640199958
#mas "Final Cut Pro", id: 424389933
#mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
#mas "Keynote", id: 409183694
#mas "Logic Pro", id: 634148309
#mas "Motion", id: 434290957
#mas "Numbers", id: 409203825
#mas "Pages", id: 409201541
#mas "Playgrounds", id: 1496833156
#mas "Transporter", id: 1450874784
mas "Xcode", id: 497799835

# Third Party
#mas "Amphetamine", id: 937984704
#mas "Disk Speed Test", id: 425264550
mas "Microsoft Remote Desktop", id: 1295203466
#mas "Shazam", id: 897118787
#mas "Silicon Info", id: 1542271266
#mas "Twitter", id: 409789998
#mas "VMware Remote Console", id: 1230249825
#mas "WireGuard", id: 1451685025
